[
    {
        "id": 1,
        "nome": "Bolo de Morango",
        "nivel": "Médio",
        "preparo": "Lave e corte os morangos, misture com os demais ingredientes, asse no forno e decore com chantilly e morangos inteiros."
      },
      {
        "id": 2,
        "nome": "Frango Assado com Ervas",
        "nivel": "Fácil",
        "preparo": "Tempere o frango com ervas, alho e limão, asse no forno até dourar e sirva com batatas assadas."
      },
      {
        "id": 3,
        "nome": "Sopa de Tomate com Manjericão",
        "nivel": "Fácil",
        "preparo": "Refogue cebola e alho, adicione tomates, caldo de legumes e manjericão. Cozinhe até os tomates desmancharem e bata tudo no liquidificador. Sirva quente com manjericão fresco."
      },
      {
        "id": 4,
        "nome": "Salada de Quinoa com Legumes",
        "nivel": "Fácil",
        "preparo": "Cozinhe a quinoa, misture com legumes picados (cenoura, pepino, tomate), temperos e molho de limão. Sirva fria."
      },
      {
        "id": 5,
        "nome": "Pasta de Grão de Bico",
        "nivel": "Médio",
        "preparo": "Cozinhe grão de bico, bata no processador com alho, tahine, suco de limão e azeite até ficar cremoso. Sirva com pão sírio ou legumes."
      },
      {
        "id": 6,
        "nome": "Risoto de Abóbora com Gorgonzola",
        "nivel": "Difícil",
        "preparo": "Refogue cebola e alho, adicione arroz arbóreo, caldo de legumes e abóbora cozida. Cozinhe até o arroz ficar al dente, adicione gorgonzola e manteiga. Mexa até ficar cremoso e sirva quente."
      },
      {
        "id": 7,
        "nome": "Tacos de Peixe",
        "nivel": "Médio",
        "preparo": "Tempere filés de peixe com limão, alho e cominho, grelhe até ficar dourado. Sirva em tortilhas com salada de repolho, molho de iogurte e coentro."
      },
      {
        "id": 8,
        "nome": "Coxinhas de Frango",
        "nivel": "Difícil",
        "preparo": "Cozinhe peito de frango com temperos, desfie e refogue com cebola e alho. Faça a massa com farinha de trigo e caldo de frango, recheie com o frango desfiado, modele em formato de coxinhas, empane e frite em óleo quente."
      },
      {
        "id": 9,
        "nome": "Bolo de Limão com Cobertura de Merengue",
        "nivel": "Médio",
        "preparo": "Misture os ingredientes da massa, asse no forno até dourar. Faça a cobertura de merengue com claras em neve e açúcar, e doure no forno. Decore com raspas de limão."
      },
      {
        "id": 10,
        "nome": "Massa de Pizza Caseira",
        "nivel": "Fácil",
        "preparo": "Misture farinha, água, fermento, sal e azeite, sove a massa até ficar elástica, deixe descansar, abra em formato de pizza e asse no forno com molho de tomate e coberturas de sua preferência."
      },
      {
        "id": 10,
        "nome": "Macarrão com Queijo",
        "nivel": "Fácil",
        "preparo": "Cozinhe o macarrão de sua preferência, escorra e misture com queijo cheddar ralado e leite. Leve ao forno para gratinar e sirva quente."
      },
      {
        "id": 12,
        "nome": "Frango Xadrez",
        "nivel": "Médio",
        "preparo": "Tempere pedaços de frango com shoyu, sauté de legumes e molho de ostra. Cozinhe até o frango ficar cozido, sirva com arroz branco."
      },
      {
        "id": 13,
        "nome": "Lasanha de Legumes",
        "nivel": "Difícil",
        "preparo": "Faça camadas de massa de lasanha, legumes refogados, molho de tomate e queijo. Repita as camadas e finalize com queijo parmesão ralado. Asse no forno até ficar dourada e borbulhante."
      },
      {
        "id": 14,
        "nome": "Bolo de Cenoura com Cobertura de Chocolate",
        "nivel": "Médio",
        "preparo": "Bata no liquidificador cenoura, óleo, ovos, açúcar e farinha de trigo. Despeje em uma forma untada e asse no forno. Faça a cobertura de chocolate com leite condensado, chocolate em pó e margarina, e cubra o bolo já assado."
      },
      {
        "id": 15,
        "nome": "Pão de Alho",
        "nivel": "Fácil",
        "preparo": "Misture margarina, alho picado, salsinha e queijo ralado. Corte pães em fatias, passe a mistura nas fatias e leve ao forno até dourar. Sirva quente como aperitivo ou acompanhamento."
      },
      {
        "id": 10,
        "nome": "Torta de Maçã",
        "nivel": "Médio",
        "preparo": "Faça uma massa com farinha, manteiga, açúcar e água, abra em uma forma de torta. Descasque e fatie maçãs, misture com açúcar, canela e suco de limão. Coloque as maçãs sobre a massa, cubra com mais massa em formato de grade e asse no forno até ficar dourada."
      },
      {
        "id": 16,
        "nome": "Arroz de Camarão",
        "nivel": "Difícil",
        "preparo": "Refogue cebola e alho, adicione arroz e caldo de camarão. Cozinhe até o arroz ficar al dente, adicione camarões limpos e temperados, pimentões e coentro. Cozinhe até o camarão ficar rosa e sirva quente."
      },
      {
        "id": 17,
        "nome": "Sopa de Legumes",
        "nivel": "Fácil",
        "preparo": "Refogue cebola e alho em azeite, adicione legumes picados, como cenoura, abobrinha, batata e tomate, e refogue por alguns minutos. Adicione caldo de legumes, tempere com sal, pimenta e ervas a gosto, e cozinhe até os legumes ficarem macios. Sirva quente."
      },
      {
        "id": 18,
        "nome": "Salada de Quinoa com Legumes",
        "nivel": "Fácil",
        "preparo": "Cozinhe a quinoa e deixe esfriar. Misture com legumes picados, como pepino, tomate, cebola roxa, pimentão e salsa. Tempere com azeite, suco de limão, sal e pimenta a gosto."
      },
      {
        "id": 19,
        "nome": "Risoto de Cogumelos",
        "nivel": "Médio",
        "preparo": "Refogue cebola e alho em manteiga, adicione arroz arbóreo e refogue mais um pouco. Acrescente caldo de legumes aos poucos, mexendo sempre, até o arroz ficar cremoso. Adicione cogumelos fatiados e queijo parmesão ralado, misture e sirva quente."
      },
      {
        "id": 20,
        "nome": "Peixe Assado com Ervas",
        "nivel": "Fácil",
        "preparo": "Tempere filés de peixe com sal, pimenta, alho e ervas frescas, como tomilho, alecrim e salsa. Regue com azeite e leve ao forno para assar até o peixe ficar cozido e dourado."
      },
      {
        "id": 21,
        "nome": "Moussaka",
        "nivel": "Difícil",
        "preparo": "Faça camadas de berinjela grelhada, carne moída refogada com tomate e cebola, e molho bechamel em um refratário. Repita as camadas e finalize com queijo parmesão ralado. Asse no forno até ficar dourada e borbulhante."
      },
      {
        "id": 22,
        "nome": "Pizza Caseira",
        "nivel": "Médio",
        "preparo": "Prepare uma massa de pizza com farinha, água, sal, açúcar e fermento. Abra a massa em formato circular, espalhe molho de tomate, queijo ralado e coberturas de sua preferência, como presunto, queijo, tomate, cebola e azeitonas. Asse no forno até a massa ficar crocante e o queijo derretido."
      },
      {
        "id": 23,
        "nome": "Frango à Parmegiana",
        "nivel": "Médio",
        "preparo": "Tempere filés de frango com sal e pimenta, empane na farinha de trigo, ovo batido e farinha de rosca. Frite em óleo quente até ficar dourado. Coloque os filés em um refratário, cubra com molho de tomate, queijo mussarela e queijo parmesão ralado. Asse no forno até o queijo derreter e dourar."
      }

]