[
  {
    
    "name": "Bolo de Cenoura",
    "type": "Sobremesa",
    "description": "Um bolo fofinho e saboroso feito com cenoura e cobertura de chocolate.",
    "image": "https://exemplo.com/imagem-bolo-cenoura.jpg",
    "ingredients": "cenoura, açúcar, farinha de trigo, ovos, óleo, fermento em pó, chocolate em pó",
    "amount": "2 cenouras médias, 2 xícaras de açúcar, 2 xícaras de farinha de trigo, 4 ovos, 1 xícara de óleo, 1 colher de sopa de fermento em pó, 3 colheres de sopa de chocolate em pó",
    "amountResult": "1 bolo",
    "prepareMode": "Bata no liquidificador as cenouras, os ovos e o óleo até obter uma mistura homogênea. Em uma tigela, misture o açúcar, a farinha de trigo, o fermento em pó e o chocolate em pó. Adicione a mistura líquida aos ingredientes secos e mexa bem. Despeje a massa em uma forma untada e leve ao forno preaquecido a 180°C por aproximadamente 40 minutos. Espere esfriar, desenforme e cubra com a cobertura de sua preferência.",
    "timingToCook": "40 minutos",
    "prepareLevel": "Médio"
  },
  {
    "name": "Feijoada",
    "type": "Refeição",
    "description": "Um prato típico brasileiro feito com feijão preto, carnes defumadas e acompanhamentos.",
    "image": "https://exemplo.com/imagem-feijoada.jpg",
    "ingredients": "feijão preto, carne seca, linguiça calabresa, costelinha de porco, bacon, cebola, alho, folhas de louro, sal",
    "amount": "500g de feijão preto, 300g de carne seca, 200g de linguiça calabresa, 200g de costelinha de porco, 100g de bacon, 1 cebola, 3 dentes de alho, 2 folhas de louro, sal a gosto",
    "amountResult": "6 porções",
    "prepareMode": "Em uma panela de pressão, cozinhe o feijão preto conforme as instruções da embalagem. Em outra panela, cozinhe a carne seca para dessalgar. Em uma terceira panela, frite o bacon até dourar. Em seguida, adicione a cebola, o alho e as carnes defumadas picadas. Refogue por alguns minutos e adicione o feijão cozido, as folhas de louro e sal a gosto. Deixe cozinhar em fogo baixo por cerca de 1 hora, mexendo de vez em quando. Sirva a feijoada acompanhada de arroz branco, couve refogada, laranja e farofa.",
    "timingToCook": "1 hora e 30 minutos",
    "prepareLevel": "Médio"
  },  
  {
    "name": "Pudim de Leite Condensado",
    "type": "Sobremesa",
    "description": "Uma sobremesa clássica brasileira feita com leite condensado, ovos e calda de caramelo.",
    "image": "https://exemplo.com/imagem-pudim-leite-condensado.jpg",
    "ingredients": "leite condensado, leite, ovos, açúcar",
    "amount": "1 lata de leite condensado, a mesma medida de leite, 3 ovos, 1 xícara de açúcar",
    "amountResult": "1 pudim",
    "prepareMode": "No liquidificador, bata o leite condensado, o leite e os ovos até obter uma mistura homogênea. Em uma forma de pudim, derreta o açúcar em fogo baixo até caramelizar toda a forma. Despeje a mistura do liquidificador na forma caramelizada e cubra com papel-alumínio. Leve ao forno em banho-maria a 180°C por aproximadamente 1 hora. Retire o papel-alumínio e deixe esfriar. Leve à geladeira por algumas horas antes de desenformar.",
    "timingToCook": "1 hora e 30 minutos",
    "prepareLevel": "Fácil"
  },
  {
    "name": "Coxinha",
    "type": "Lanche",
    "description": "Uma famosa iguaria brasileira feita com massa de batata recheada de frango e frita até ficar crocante.",
    "image": "https://exemplo.com/imagem-coxinha.jpg",
    "ingredients": "batata, farinha de trigo, caldo de galinha, frango desfiado, cebola, alho, sal, pimenta-do-reino, óleo",
    "amount": "500g de batata, 2 xícaras de farinha de trigo, 1 tablete de caldo de galinha, 300g de frango desfiado, 1 cebola, 2 dentes de alho, sal e pimenta-do-reino a gosto, óleo para fritar",
    "amountResult": "12 coxinhas",
    "prepareMode": "Cozinhe as batatas até ficarem macias. Amasse-as bem e reserve. Em uma panela, refogue a cebola e o alho até dourar. Adicione o frango desfiado, o caldo de galinha esfarelado, sal e pimenta-do-reino. Refogue por alguns minutos. Em outra panela, adicione a batata amassada e a farinha de trigo, mexendo bem até obter uma massa homogênea. Em seguida, abra pequenas porções da massa na palma da mão, coloque o recheio de frango e modele as coxinhas. Aqueça o óleo em uma panela e frite as coxinhas até ficarem douradas e crocantes. Escorra em papel-toalha antes de servir.",
    "timingToCook": "1 hora",
    "prepareLevel": "Médio"
  },
  {
    "name": "Caipirinha",
    "type": "Bebida",
    "description": "Uma refrescante bebida brasileira feita com cachaça, limão, açúcar e gelo.",
    "image": "https://exemplo.com/imagem-caipirinha.jpg",
    "ingredients": "limão, açúcar, cachaça, gelo",
    "amount": "1 limão, 2 colheres de sopa de açúcar, 50ml de cachaça, gelo a gosto",
    "amountResult": "1 caipirinha",
    "prepareMode": "Corte o limão em rodelas e coloque em um copo. Adicione o açúcar e macere suavemente até extrair o suco do limão. Acrescente a cachaça e misture bem. Adicione o gelo e mexa novamente. Sirva imediatamente.",
    "timingToCook": "5 minutos",
    "prepareLevel": "Fácil"
  },
  {
    "name": "Brigadeiro",
    "type": "Sobremesa",
    "description": "Um doce tradicional brasileiro feito com leite condensado, chocolate em pó e manteiga.",
    "image": "https://exemplo.com/imagem-brigadeiro.jpg",
    "ingredients": "leite condensado, chocolate em pó, manteiga, granulado",
    "amount": "1 lata de leite condensado, 3 colheres de sopa de chocolate em pó, 1 colher de sopa de manteiga, granulado para decorar",
    "amountResult": "15 brigadeiros",
    "prepareMode": "Em uma panela, misture o leite condensado, o chocolate em pó e a manteiga. Leve ao fogo baixo, mexendo sempre, até desprender do fundo da panela e obter uma consistência firme. Despeje a massa em um prato untado com manteiga e deixe esfriar. Com as mãos untadas, faça bolinhas com a massa e passe-as no granulado. Sirva em forminhas de papel.",
    "timingToCook": "20 minutos",
    "prepareLevel": "Fácil"
  },
  {
    "name": "Moqueca de Peixe",
    "type": "Refeição",
    "description": "Um prato típico da culinária baiana feito com peixe, leite de coco, dendê e temperos.",
    "image": "https://exemplo.com/imagem-moqueca-peixe.jpg",
    "ingredients": "peixe (robalo, badejo ou outro de sua preferência), cebola, tomate, pimentão, coentro, leite de coco, azeite de dendê, limão, sal, pimenta",
    "amount": "800g de peixe em postas, 1 cebola, 2 tomates, 1 pimentão, coentro a gosto, 200ml de leite de coco, 2 colheres de sopa de azeite de dendê, suco de 1 limão, sal e pimenta a gosto",
    "amountResult": "4 porções",
    "prepareMode": "Tempere o peixe com suco de limão, sal e pimenta. Em uma panela grande, faça uma camada com a cebola, o tomate e o pimentão cortados em rodelas. Coloque as postas de peixe por cima e adicione o coentro picado. Despeje o leite de coco e o azeite de dendê sobre o peixe. Leve ao fogo baixo, com a panela tampada, por cerca de 20 minutos ou até o peixe ficar macio. Sirva com arroz branco e pirão.",
    "timingToCook": "30 minutos",
    "prepareLevel": "Médio"
  },  
  {
    "name": "Pão de Queijo",
    "type": "Café da Manhã",
    "description": "Um pãozinho de origem mineira feito com polvilho azedo, queijo e ovos.",
    "image": "https://exemplo.com/imagem-pao-de-queijo.jpg",
    "ingredients": "polvilho azedo, queijo meia cura, ovos, leite, óleo, sal",
    "amount": "500g de polvilho azedo, 250g de queijo meia cura ralado, 3 ovos, 1 xícara de leite, 1/2 xícara de óleo, sal a gosto",
    "amountResult": "20 pãezinhos",
    "prepareMode": "Em uma tigela, misture o polvilho azedo com o queijo ralado e o sal. Em uma panela, aqueça o leite e o óleo até ferver. Despeje essa mistura sobre o polvilho e misture bem. Adicione os ovos e continue misturando até obter uma massa homogênea. Modele pequenas bolinhas e coloque em uma assadeira untada. Leve ao forno preaquecido a 180°C por cerca de 25 minutos ou até dourarem. Sirva quentinhos.",
    "timingToCook": "25 minutos",
    "prepareLevel": "Fácil"
  },
  {
    "name": "Açaí na tigela",
    "type": "Café da Manhã",
    "description": "Uma opção saudável e refrescante para o café da manhã, feita com açaí, frutas e granola.",
    "image": "https://exemplo.com/imagem-acai-tigela.jpg",
    "ingredients": "polpa de açaí, banana, morango, granola, mel",
    "amount": "200g de polpa de açaí congelada, 1 banana, 4 morangos, 2 colheres de sopa de granola, mel a gosto",
    "amountResult": "1 tigela",
    "prepareMode": "No liquidificador, bata a polpa de açaí com a banana até obter uma mistura cremosa. Despeje em uma tigela e decore com os morangos cortados em fatias, a granola e o mel. Sirva imediatamente.",
    "timingToCook": "5 minutos",
    "prepareLevel": "Fácil"
  },
  {
    "name": "Bolo de Fubá",
    "type": "Sobremesa",
    "description": "Um bolo brasileiro feito com fubá, leite, açúcar e queijo ralado.",
    "image": "https://exemplo.com/imagem-bolo-fuba.jpg",
    "ingredients": "fubá, açúcar, farinha de trigo, leite, óleo, ovos, queijo ralado, fermento em pó",
    "amount": "2 xícaras de fubá, 2 xícaras de açúcar, 1 xícara de farinha de trigo, 2 xícaras de leite, 1/2 xícara de óleo, 3 ovos, 50g de queijo ralado, 1 colher de sopa de fermento em pó",
    "amountResult": "1 bolo",
    "prepareMode": "Em uma tigela, misture o fubá, o açúcar, a farinha de trigo e o fermento em pó. Adicione o leite, o óleo e os ovos, e misture bem até obter uma massa homogênea. Acrescente o queijo ralado e misture novamente. Despeje a massa em uma forma untada e leve ao forno preaquecido a 180°C por aproximadamente 40 minutos, ou até que o bolo esteja dourado e firme. Espere esfriar antes de desenformar e servir.",
    "timingToCook": "40 minutos",
    "prepareLevel": "Fácil"
  },  
  {
    "name": "Bobó de Camarão",
    "type": "Refeição",
    "description": "Um prato tradicional da culinária baiana feito com camarão, mandioca, leite de coco e temperos.",
    "image": "https://exemplo.com/imagem-bobo-camarao.jpg",
    "ingredients": "camarão, mandioca, leite de coco, azeite de dendê, cebola, alho, pimentão, tomate, coentro, sal, pimenta",
    "amount": "500g de camarão limpo, 500g de mandioca descascada e picada, 1 vidro de leite de coco (200ml), 2 colheres de sopa de azeite de dendê, 1 cebola picada, 3 dentes de alho picados, 1 pimentão picado, 2 tomates picados, coentro picado a gosto, sal e pimenta a gosto",
    "amountResult": "4 porções",
    "prepareMode": "Cozinhe a mandioca em água com sal até que fique macia. Escorra e reserve. Em uma panela, aqueça o azeite de dendê e refogue a cebola, o alho, o pimentão e o tomate. Adicione o camarão e refogue por alguns minutos. Acrescente a mandioca cozida e o leite de coco. Cozinhe por cerca de 15 minutos, mexendo de vez em quando, até que a mandioca se desmanche e o caldo engrosse. Tempere com sal, pimenta e coentro a gosto. Sirva quente acompanhado de arroz branco.",
    "timingToCook": "40 minutos",
    "prepareLevel": "Médio"
  }
]
  